leocafonso/nuttx/arch/arm/src/ra4m1/ra4m1_icu.c
/****************************************************************************
 * arch/arm/src/ra4m1/ra4m1_icu.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#ifdef CONFIG_SERIAL_TERMIOS
#  include <termios.h>
#endif

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/fs/ioctl.h>
#include <nuttx/serial/serial.h>

#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"

#include "hardware/ra4m1_sci.h"
#include "hardware/ra4m1_mstp.h"
#include "hardware/ra4m1_system.h"
#include "hardware/ra4m1_icu.h"
#include "ra4m1_icu.h"
#include "ra4m1_lowputc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Public Functions
 ****************************************************************************/
void ra4m1_attach_icu(elc_event_t event)
{
    uint32_t regval;
    int i = 0;
    do{
        regval = getreg32(R_ICU_IELSR(i));
        i++;
    }while(i < RA4M1_IRQ_NEXTINT && regval != 0);
    regval =  event;
    putreg32(regval, R_ICU_IELSR(i));
}
